In [2]:
import numpy as np
import pandas as pd

In [3]:
dict1={
    "name":["rohan","seema","mahesh","shruti"],
    "marks":[9,55,67,98],
    "city":["Delhi","Jaipur","Rampur","Barilly"]
}

In [4]:
df=pd.DataFrame(dict1)

In [5]:
df

     name  marks     city
0   rohan      9    Delhi
1   seema     55   Jaipur
2  mahesh     67   Rampur
3  shruti     98  Barilly

In [6]:
df.index=[1,2,3,4]

In [7]:
df

     name  marks     city
1   rohan      9    Delhi
2   seema     55   Jaipur
3  mahesh     67   Rampur
4  shruti     98  Barilly

In [8]:
ser=pd.Series(np.random.rand(20))

In [9]:
ser

0     0.045106
1     0.570694
2     0.203695
3     0.536789
4     0.300907
5     0.747394
6     0.935205
7     0.892722
8     0.893009
9     0.099040
10    0.025138
11    0.545867
12    0.103460
13    0.737186
14    0.499036
15    0.179445
16    0.020295
17    0.211236
18    0.444095
19    0.512021
dtype: float64

In [10]:
type(ser)

pandas.core.series.Series

In [11]:
newdf=pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [12]:
newdf

            0         1         2         3         4
0    0.298722  0.560657  0.403522  0.299085  0.651477
1    0.181200  0.394824  0.525284  0.113356  0.601598
2    0.617660  0.784587  0.964819  0.502222  0.442313
3    0.848973  0.927757  0.046162  0.665337  0.919845
4    0.648770  0.525274  0.290019  0.645283  0.191309
..        ...       ...       ...       ...       ...
329  0.493249  0.582379  0.454780  0.487069  0.907879
330  0.441927  0.600253  0.205762  0.753618  0.780976
331  0.273251  0.681370  0.521051  0.345783  0.068303
332  0.030221  0.315938  0.726727  0.989561  0.558951
333  0.135610  0.386737  0.101512  0.493702  0.759166

[334 rows x 5 columns]

In [13]:
newdf.head(3)

          0         1         2         3         4
0  0.298722  0.560657  0.403522  0.299085  0.651477
1  0.181200  0.394824  0.525284  0.113356  0.601598
2  0.617660  0.784587  0.964819  0.502222  0.442313

In [14]:
newdf.sort_index(axis=0)

            0         1         2         3         4
0    0.298722  0.560657  0.403522  0.299085  0.651477
1    0.181200  0.394824  0.525284  0.113356  0.601598
2    0.617660  0.784587  0.964819  0.502222  0.442313
3    0.848973  0.927757  0.046162  0.665337  0.919845
4    0.648770  0.525274  0.290019  0.645283  0.191309
..        ...       ...       ...       ...       ...
329  0.493249  0.582379  0.454780  0.487069  0.907879
330  0.441927  0.600253  0.205762  0.753618  0.780976
331  0.273251  0.681370  0.521051  0.345783  0.068303
332  0.030221  0.315938  0.726727  0.989561  0.558951
333  0.135610  0.386737  0.101512  0.493702  0.759166

[334 rows x 5 columns]

In [15]:
newdf.drop(0,axis=1)

            1         2         3         4
0    0.560657  0.403522  0.299085  0.651477
1    0.394824  0.525284  0.113356  0.601598
2    0.784587  0.964819  0.502222  0.442313
3    0.927757  0.046162  0.665337  0.919845
4    0.525274  0.290019  0.645283  0.191309
..        ...       ...       ...       ...
329  0.582379  0.454780  0.487069  0.907879
330  0.600253  0.205762  0.753618  0.780976
331  0.681370  0.521051  0.345783  0.068303
332  0.315938  0.726727  0.989561  0.558951
333  0.386737  0.101512  0.493702  0.759166

[334 rows x 4 columns]

In [16]:
newdf.dropna(inplace=True)